x=0.9;
s=0;
if true; then
while true;
do 
x=$(bc<<<";$x+$s")
echo "Помяни, Господи, во Царствии Своем:"
sleep $x
echo "Мученника Вонифатия"
sleep $x
echo "Праведного Иоанна Кронштадского"
sleep $x
echo "Святителя Петра, митрополита Киевского, московского и всея Руси, чудотворца"
sleep $x
echo "Великомученицу Анастасию Узорешительницу"
sleep $x
echo "Мучеников, иже в Крите"
sleep $x
echo "Преподобномученницу Евгению"
sleep $x
echo "Собор Пресвятой Богородицы"
sleep $x
echo "Апостола первомученика и архидиакона Стефана"
sleep $x
echo "Преподобного Корнилия Крыпецкого"
sleep $x
echo "Мучеников 14000 младенцев, от Ирода в Вифлееме избиенных"
sleep $x
echo "Святителя Макария, митрополита Московского"
sleep $x
echo "Преподобной Мелании Римляныни"
sleep $x
echo "Святителя Василия Великого"
sleep $x
echo "Преставление преподобного Серафима Саровского, чудотворца"
sleep $x
echo "Пророка Малахии"
sleep $x
echo "Собор 70 апостолов"
sleep $x
echo "Пророка Михея"
sleep $x
echo "Собор Предтечи и Крестителя Господня Иоанна"
sleep $x 
echo "Священномученика Исидора пресвитера и с ним 72, в Юрьеве Лифляндском пострадавших"
sleep $x
echo "Святителя Филиппа, митрополита Московского и всея России, чудотворца"
sleep $x
echo "Святителя Феофана, Затворника Вышенского"
sleep $x
echo "Преподобного Феодосия Великого, общих житий начальника"
sleep $x
echo "Мученницу Татиану и снею в Риме пострадавших"
sleep $x
echo "Мученников Ермила и Стратоника"
sleep $x
echo "Равноапостольную Нину, просветительницу Грузии"
sleep $x
echo "Преподобного Павла Фивейского"
sleep $x
echo "Преподобного Антония Великого"
sleep $x
echo "Преподобных схимонаха Кирилла и схимонахини Марии, родителей преподобного Сергия Радонежского"
sleep $x
echo "Преподобного Макария Великого, Египетского"
sleep $x
echo "Преподобного Евфимия Великого"
sleep $x
echo "Преподобного Максима Грека"
sleep $x 
echo "Апостола Тимофея"
sleep $x
echo "Преподобного Геннадия Костомского, Любимоградского"
sleep $x
echo "Блаженной Ксении Петербургской"
sleep $x
echo "Святителя Григория Богослова, архиепископа Константинопольского"
sleep $x
echo "Перенесение мощей преподобного Феодора, игумена Студийского"
sleep $x
echo "Перенесение мощей святителя Иоанна Златоуста"
sleep $x
echo "Преподобного Ефрема Сирина"
sleep $x
echo "Перенесение мощей священномученника Игнатия Богоносца"
sleep $x
echo "Собор вселенских учителей и святителей Василия Великого, Григория Богослова и Иоанна Златоустого"
sleep $x
echo "Бессребренников мученников Кира и Иоанна"
sleep $x
echo "Мученника Трифона"
sleep $x
echo "Равноапостольного Николая, архиепископа Японского"
sleep $x
echo "Благоверного великого князя Георгия (Юрия) Всеволодовича Владимирского"
sleep $x
echo "Святителя Феодосия, архиепископа Черниговского"
sleep $x
echo "Святителя Фотия, патриарха Константинопольского"
sleep $x
echo "Преподобного Парфения, епископа Лампсакийского"
sleep $x
echo "Пророка Захарии Серповидца, из 12"
sleep $x
echo "Обретение мощей святителя Иннокентия, епископа Иркутского"
sleep $x
echo "Священномученника Харалампия"
sleep $x
echo "Преподобного Димитрия Прилуцкого, Вологодского"
sleep $x
echo "Иверской иконы Божией Матери"
sleep $x
echo "Преподобной Зои"
sleep $x
echo "Равноапостольного Кирилла, учителя Словенского"
sleep $x
echo "Виленской иконы Божией Матери"
sleep $x
echo "Святителя Московского Макария"
sleep $x
echo "Великомученника Феодора Тирона"
sleep $x
echo "Святителя Льва, папы Римского"
sleep $x
echo "Преподобного Феодора Санаксарского"
sleep $x
echo "Преподобномученника Корнилия Псково-Печерского"
sleep $x
echo "Святителя Евстафия, архиепископа Антиохийского"
sleep $x
echo "Преподобномученников Фалассия, Лимния и Варадата, пустынников Сирийских"
sleep $x
echo "Священномученника Поликарпа епископа Смирнского"
sleep $x
echo "Первое и второе обретение главы Иоанна Предтечи"
sleep $x
echo "Святителя Тарасия, архиепископа Константинопольского"
sleep $x
echo "Святителя Порфирия, архиепископа Газского"
sleep $x
echo "Преподобного Прокопия Декаполита, исповедника"
sleep $x
echo "Блаженного Николая, Христа ради юродивого, Псковского"
sleep $x
echo "Преподобного Кассиана Римлянина"
sleep $x
echo "Преподобномученницы Евдокии"
sleep $x
echo "Иконы Божией Матери, именуемой Державная"
sleep $x
echo "Мученников Евтропия, Клеоника и Василиска"
sleep $x
echo "Преподобных Герасима, иже на Иордане"
sleep $x
echo "Иконы Божией Матери Именуемой Воспитание"
sleep $x
echo "Мученников 42 во Амморее: Константина, Аетия, Феофила и прочих с ними"
sleep $x
echo "Священномученников, в Херсонесе епископствовавших: Василия, Ефрема, Капитона, Евгения, Еферия, Елпидия и Агафодора"
sleep $x
echo "Иконы Божией Матери Знамение Курской-Коренной"
sleep $x
echo "40 мученников, в Севастийском озере мучившихся"
sleep $x
echo "мученницы Василиссы"
sleep $x
echo "Святителя Софрония, патриарха Иерусалимского"
sleep $x
echo "Святителя Григория Двоеслова, папы Римского"
sleep $x
echo "Мученницы Христины Персидской"
sleep $x
echo "Феодоровской иконы Божией Матери"
sleep $x
echo "Мученника Агапия и с ним семи мученников"
sleep $x
echo "Святителя Серапиона, архиепископа Новгородского"
sleep $x
echo "Преподобного Алексия, человека Божия"
sleep $x
echo "Святителя Кирилла, архиепископа Иерусалимского"
sleep $x
echo "Праведной Софии, княгини Слуцкой"
sleep $x
echo "Мученницы Фотины (Светланы) самаряныни"
sleep $x
echo "Преподобного Серафима Вырицкого"
sleep $x
echo "Священномученника Василия, пресвитера Анкирского"
sleep $x
echo "Мученников Филита, Лидии, жены его, Македона, Феопрепия, Кронида и Амфилохия"
sleep $x
echo "Иконы Божией Матери, именуемой Тучная Гора"
sleep $x
echo "Мученниц Ларисы, Аллы"
sleep $x
echo "Мученницы Матроны Солунской"
sleep $x
echo "Мученника Бояна, князя Болгарского"
sleep $x
echo "Преподобного Марка"
sleep $x
echo "Священномученника Ипатия, епископа Гангрского"
sleep $x
echo "Преподобного Варсонофия Оптинского"
sleep $x
echo "Мученников Амфиана и Едесия"
sleep $x
echo "Воспоминание Тайной Вечери"
sleep $x
echo "Воспоминание Святых спасительных Страстей Господа нашего Иисуса Христа"
sleep $x
echo "Перенесение мощей святителя Иова, патриарха Московского и всея России"
sleep $x
echo "Преподобного Даниила Переяславского"
sleep $x
echo "Апостолов Иродиона, Агава, Асинкрита, Руфа, Флегонта, Ерма и иже с ними"
sleep $x
echo "Преподобномученника Вадима архимандрита"
sleep $x
echo "Мученников Терентия, Помпия, Африкана, Максима, Зинона, Александра, Феодора и иных 33"
sleep $x
echo "Священномученика Антипы, епископа Пергама Асийского"
sleep $x
echo "Преподобного Исаака Сирина, в Сполете Италийском"
sleep $x
echo "Мученника Крискента, из Мир Лкийских"
sleep $x
echo "Мученников Антония, Иоанна и Евстафия Литовских"
sleep $x
echo "Апостолов от 70 Аристарха, Пуда и Трофима"
sleep $x
echo "Мученника Леонида"
sleep $x
echo "Преподобного Зосимы, игумена Соловецкого"
sleep $x
echo "Мученников Виктора, Зотика, Зинона, Акиндина и Севериана"
sleep $x
echo "Блаженную Матрону Московскую"
sleep $x
echo "Святых жен-мироносиц: Марию Магдалину, Марию Клеопову, Саломию, Иоанну, Марфу и Марию, Сусанну и иных"
sleep $x
echo "Мученника Феодора, иже в Пергии"
sleep $x
echo "Преподобного Виталия"
sleep $x
echo "Великомученника Георгия Победоносца"
sleep $x
echo "Мученника Саввы Стратилата"
sleep $x
echo "Апостола ие евангелиста Марка"
sleep $x
echo "Святителя Стефана, епископа Великопермского"
sleep $x
echo "Апостола и священномученника Симеона, сродника Господня"
sleep $x
echo "Святителя Кирилла, епископа Туровского"
sleep $x
echo "Святителя Василия Острожского"
sleep $x
echo "Святителя Игнатия Брянчанинова, епископа Кавказского"
sleep $x
echo "Благоверную Тамару, царицу Грузинскую"
sleep $x
echo "Перенесение мощей благоверных князей Российских Бориса и Глеба, во святом крещении Романа и Давида"
sleep $x
echo "Преподобного Феодосия, игумена Киево-Печерского"
sleep $x
echo "Священномученника Сильвана, епископа Газского"
sleep $x
echo "Иконы Божией Матери Неупиваемая Чаша"
sleep $x
echo "Мученника Варвара, бывшего разбойника"
sleep $x
echo "Иконы Божией Матери Жировичская"
sleep $x
echo "Апостола и евангелиста Иоанна Богослова"
sleep $x
echo "Перенесение мощей святителя и чудотворца Николая из Мир Ликийских в Бар"
sleep $x
echo "Апостола Симона Зилота"
sleep $x
echo "Равноапостольных Мефодия и Кирилла, учителей Словенских"
sleep $x
echo "Священномученника Ермогена, патриарха Московского и всея России, чудотворца"
sleep $x
echo "Перенесение мощей преподобномученника Макария, архимандрита Каневского, игумена Пинского, Переяславского, чудотворца"
sleep $x
echo "Святителя Никиты, затворника Печерского, епископа Новгородского"
sleep $x
echo "Мученников Вита, Модеста и Крискентии"
sleep $x
echo "Преподобных Евфросинии, в миру Евдокии, великой княгини Московской"
sleep $x
echo "Праведного Иоанна Кронштадтского"
sleep $x
echo "Благоверного великого князя Димитрия Донского"
sleep $x
echo "Обретение мощей святителя Алексия, митрополита Киевского, Московского и всея Руси, чудотворца"
sleep $x
echo "Равноапостольного царя Константина и матери его царицы Елены"
sleep $x
echo "Мученника Василиска"
sleep $x
echo "Преподобной Евфросинии, игумении Полоцкой"
sleep $x
echo "Преподобного Симеона Столпника на Дивной Горе"
sleep $x
echo "Обретение мощей преподобного Макария Калязинского"
sleep $x
echo "Праведного Иоанна Русского, исповедника"
sleep $x
echo "Преподобной Елены Дивеевской"
sleep $x
echo "Святителя Луки исповедника, архиепископа Симферопольского"
sleep $x
echo "Преподобного Исаакия исповедника, игумена обители Далматской"
sleep $x
echo "Мученника Ермия"
sleep $x
echo "Праведного Иоанна Кронштадского"
sleep $x
echo "Обретение мощей мученицы праведной Иулиании, княгини Вяземской, Новоторжской"
sleep $x
echo "Перенесение мощей благоверного царевича Димитрия из Углича в Москву"
sleep $x
echo "Преподобного Мефодия, игумена Пешношского"
sleep $x
echo "Перенесение мощей благоверного великого князя Игоря Черниговского и Киевского"
sleep $x
echo "Преподобного Илариона Нового"
sleep $x
echo "Мученницы Валерии (Калерии), Кириакии и Марии в Кесарии Палестинской"
sleep $x
echo "Великомученника Феодора Стратилата"
sleep $x
echo "Преподобного Кирилла, игумена Белоезерского"
sleep $x
echo "Святителя Иоанна, митрополита Тобольского"
sleep $x
echo "Иконы Божией Матери именуемой Достойно есть"
sleep $x
echo "Преподобного Онуфрия Великого"
sleep $x
echo "Мученницы Антонины"
sleep $x
echo "Собор Дивеевских святых"
sleep $x
echo "Святителя Ионы, митрополита Московского и всея России, чудотворца"
sleep $x
echo "Преподобного Моисея Оптинского"
sleep $x
echo "Мученников Мануила, Савела и Исмаила"
sleep $x
echo "Аминь."
echo ""
done
fi

